# RightOffset Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
CameraInfo..::..RightOffset Property
CameraInfo Class See Also
---
Distance that the target plane is offset towards the right where right is normal to both Up direction and View direction. This offset shifts both left and right planes.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public double RightOffset { get; }
```

Visual Basic
---
```text
Public ReadOnly Property RightOffset As Double
	Get
```

Visual C++
---
```text
public:
property double RightOffset {
	double get ();
}
```

# See Also
CameraInfo Class
Autodesk.Revit.DB Namespace